In [1]:
import pandas as pd

## Pandas

#### Series

In [2]:
ab=[1,2,3,4,5,6,7,8]
pd.Series(ab)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [3]:
xy=[10,20,30,40]
temp=pd.Series(xy,['sangli','satara','kolhapur','pune'])
temp

sangli      10
satara      20
kolhapur    30
pune        40
dtype: int64

In [4]:
tup=(101,102,103,104)
pd.Series(tup)

0    101
1    102
2    103
3    104
dtype: int64

In [5]:
n=pd.Series(tup,['a','b','c','d'])
n

a    101
b    102
c    103
d    104
dtype: int64

#### Arithmatic operations in Series

In [6]:
a1=pd.Series([1,2,3,4,5])
a2=pd.Series([6,7,8,9,10])

In [7]:
a1.add(a2)

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [8]:
a1.sub(a2)

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [9]:
a1.multiply(a2)

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [10]:
a1.div(a2)

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

#### Comparison opertors

In [11]:
a1.gt(a2)

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [12]:
a1.lt(a2)

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [13]:
a2.sub(a1)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [14]:
a2.mul(a1)

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [15]:
a1.eq(a2)

0    False
1    False
2    False
3    False
4    False
dtype: bool

### DataFrame

In [16]:
emp={'empid':[101,102,103],'empname':['vishakha','pallavi','vaishali'],'empsalary':[50000,48000,55000],'emplocation':['Hydrabad','pune','mumbai']}
print(emp)

{'empid': [101, 102, 103], 'empname': ['vishakha', 'pallavi', 'vaishali'], 'empsalary': [50000, 48000, 55000], 'emplocation': ['Hydrabad', 'pune', 'mumbai']}

In [17]:
ab=pd.DataFrame(emp)
ab

   empid   empname  empsalary emplocation
0    101  vishakha      50000    Hydrabad
1    102   pallavi      48000        pune
2    103  vaishali      55000      mumbai

In [18]:
ab[:2]

   empid   empname  empsalary emplocation
0    101  vishakha      50000    Hydrabad
1    102   pallavi      48000        pune

In [19]:
ab[1:]

   empid   empname  empsalary emplocation
1    102   pallavi      48000        pune
2    103  vaishali      55000      mumbai

### loc & iloc

In [20]:
ab.loc[:1]

   empid   empname  empsalary emplocation
0    101  vishakha      50000    Hydrabad
1    102   pallavi      48000        pune

In [21]:
ab.iloc[:1]

   empid   empname  empsalary emplocation
0    101  vishakha      50000    Hydrabad

### Combination

In [22]:
mh=pd.DataFrame({'city':['sangli','satara','kolhapur'],'Temp':[20,30,25]})
mh

       city  Temp
0    sangli    20
1    satara    30
2  kolhapur    25

In [25]:
gujrat=pd.DataFrame({'city':['surat','Gandhinagar','Ahmedabad'],'Temp':[26,27,25]})
gujrat

          city  Temp
0        surat    26
1  Gandhinagar    27
2    Ahmedabad    25

In [31]:
data=pd.concat([mh,gujrat],ignore_index=True)
data

          city  Temp
0       sangli    20
1       satara    30
2     kolhapur    25
3        surat    26
4  Gandhinagar    27
5    Ahmedabad    25

### Merge

#### 1.Inner merge

In [33]:
df1=pd.DataFrame({'country':['India','US','UK','UAE'],'Temp':[25,23,26,24]})
df1

  country  Temp
0   India    25
1      US    23
2      UK    26
3     UAE    24

In [34]:
df2=pd.DataFrame({'country':['India','US','UK','Canada'],'Humidity':[80,83,86,84]})
df2

  country  Humidity
0   India        80
1      US        83
2      UK        86
3  Canada        84

In [36]:
inner_merge=pd.merge(df1,df2,how='inner',on='country')
inner_merge

  country  Temp  Humidity
0   India    25        80
1      US    23        83
2      UK    26        86

In [37]:
outer_merge=pd.merge(df1,df2,how='outer',on='country')
outer_merge

  country  Temp  Humidity
0  Canada   NaN      84.0
1   India  25.0      80.0
2     UAE  24.0       NaN
3      UK  26.0      86.0
4      US  23.0      83.0

In [38]:
left_merge=pd.merge(df1,df2,how='left',on='country')
left_merge

  country  Temp  Humidity
0   India    25      80.0
1      US    23      83.0
2      UK    26      86.0
3     UAE    24       NaN

In [39]:
right_merge=pd.merge(df1,df2,how='right',on='country')
right_merge

  country  Temp  Humidity
0   India  25.0        80
1      US  23.0        83
2      UK  26.0        86
3  Canada   NaN        84